app/views/shared/_comment_box.html.erb

        <% @comments.limit(5).each do |comment| %>
        <% user = User.find(comment.author_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]