app/views/posts/index.html.erb

    <%= render "shared/post_box", post: post %>
    <% @comments = Comment.where(post_id: post.id) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

        <% @comments.limit(5).each do |comment| %>
          <%= render "shared/comment_box", comment: comment, user: User.find(comment.author_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]