app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "asfasgasggasg"], ["author_id", 1], ["post_id", 2], ["created_at", "2023-08-24 20:39:55.577367"], ["updated_at", "2023-08-24 20:39:55.577367"]]
---
  def create
    @comment = @post.comments.new(comment_params)
    @comment.author = current_user
    if @comment.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
---
  def set_user_post
    @user = User.find(params[:user_id])
    @post = @user.posts.find(params[:post_id])