app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]
---
  def index
    @page_title = 'Post Index Page'
    @user = User.includes(:posts).find(params[:user_id])
    @posts = Post.includes(:author, :comments, :likes).where(author_id: @user.id)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @page_title = 'Post Show Page'
    @post = @user.posts.find(params[:id])

INSERT INTO "posts" ("author_id", "title", "text", "comments_counter", "likes_counter", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = current_user.posts.new(post_params)
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.comments.destroy_all
    @post.destroy

INSERT INTO "likes" ("author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 210], ["post_id", 376], ["created_at", "2023-08-28 21:07:51.750177"], ["updated_at", "2023-08-28 21:07:51.750177"]]
UPDATE "posts" SET "likes_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_counter", 1], ["updated_at", "2023-08-28 21:07:51.757951"], ["id", 376]]
---
  def like
    @post = @user.posts.find(params[:id])
    @like = @post.likes.create(author: current_user)
    @like.save