app/controllers/users_controller.rb

  def index
    @page_title = 'User Index Page'
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @page_title = 'User Show Page'
    @user = User.find(params[:id])
    @posts = Post.where(author_id: @user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1 LIMIT $2  [["author_id", 1], ["LIMIT", 1]]