app/models/comment.rb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 14]]
UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 1], ["updated_at", "2023-08-24 20:35:35.149650"], ["id", 14]]
---
  def update_comments_counter
    posts.update(comments_counter: posts.comments.count)