app/models/post.rb

SELECT COUNT(*) FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]
---
  def update_posts_counter
    author.update(posts_counter: author.posts.count)